modules/settings/misc.org
#+STARTUP: overview
#+PROPERTY: header-args :tangle yes

* saving
** save all
#+BEGIN_SRC emacs-lisp
(defun my/save-all ()
  (interactive)
  (setq current-prefix-arg '(4))
  (call-interactively 'save-some-buffers))
#+END_SRC
** quiet save
#+BEGIN_SRC emacs-lisp
(defun my/quiet-save-buffer () (interactive)
       (save-excursion
	 (evil-ex-nohighlight)
	 (let ((inhibit-message t))
	   (delete-trailing-whitespace)
	   (save-buffer))))

(defun my/quiet-save-buffer-markdown () (interactive)
       (save-excursion
	 (evil-ex-nohighlight)
	 (let ((inhibit-message t))
	   (save-buffer))))

(defun my/quiet-indent-and-save-buffer ()
  (interactive)
  (evil-ex-nohighlight)
  (indent-buffer-no-excursion)
  (let ((inhibit-message t))
    (save-buffer)))
#+END_SRC

* motions
** widen to center
#+BEGIN_SRC emacs-lisp
(defun widenToCenter ()
  (interactive)
  (save-excursion
    (widen)
    (recenter)))
#+END_SRC
* date
#+BEGIN_SRC emacs-lisp
(defun my/date ()
  (interactive)
  (save-excursion
    (shell-command "date")))
#+END_SRC
* misc
#+BEGIN_SRC emacs-lisp
(setq mouse-autoselect-window t)
(setq calc-display-trail nil)
(setq apropos-do-all t)
(setq load-prefer-newer t)
#+END_SRC
* my/ranger
#+BEGIN_SRC emacs-lisp
;; (defun my/ranger ()
;;   (interactive)
;;   (my/copy-dir)
;;   (start-process-shell-command "my/show-ranger" nil "~/scripts/emacs_scripts/show-ranger"))
#+END_SRC
* disable cursor
#+BEGIN_SRC emacs-lisp
(defun my/disable-cursor ()
  (interactive)
  (setq-local cursor-type nil))
#+END_SRC
